       IDENTIFICATION DIVISION.
       PROGRAM-ID. Hello.
       AUTHOR. Lucien HAMM.

       PROCEDURE DIVISION.
           DISPLAY "HelloBOL !".
           STOP RUN.
